app/controllers/api/v1/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    foods = Food.all

SELECT  "foods".* FROM "foods"  ORDER BY RANDOM() LIMIT 1
---
  def random
    food = Food.order("RANDOM()").limit(1)