app/controllers/api/v1/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
  def index
    jokes = Joke.all

SELECT  "jokes".* FROM "jokes"  ORDER BY RANDOM() LIMIT 1
---
  def random
    joke = Joke.order("RANDOM()").limit(1)