app/views/foods/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                %td
                  = food.user.first_name rescue nil