app/views/foods/show.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
        Author:
      = @food.user.first_name rescue nil