app/controllers/foods_controller.rb

SELECT  "foods".* FROM "foods" LIMIT 20 OFFSET 0
---
  def index
    @foods = Food.paginate(:page => params[:page], :per_page => 20)

INSERT INTO "foods" ("name", "user_id", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["user_id", 1], ["url", "http://google.com"], ["created_at", "2016-02-07 19:29:39.663124"], ["updated_at", "2016-02-07 19:29:39.663124"]]
---
  def create
    @food = Food.new(food_params)
    if @food.save

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @food = Food.find(params[:id])