app/controllers/jokes_controller.rb

SELECT  "jokes".* FROM "jokes" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "jokes"
---
  def index
    @jokes = Joke.paginate(:page => params[:page], :per_page => 20)

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @joke = Joke.find(params[:id])

INSERT INTO "jokes" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "You want to hear a pizza joke? Never mind, it’s pretty cheesy."], ["user_id", 1], ["created_at", "2016-01-30 17:59:09.694356"], ["updated_at", "2016-01-30 17:59:09.694356"]]
---
  def create
    @joke = Joke.new(joke_params)
    if @joke.save

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @joke = Joke.find(params[:id])

SELECT  "jokes".* FROM "jokes" WHERE "jokes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "jokes" SET "content" = $1, "updated_at" = $2 WHERE "jokes"."id" = $3  [["content", "You want to hear a pizza joke? Never mind, it’s pretty cheesy!"], ["updated_at", "2016-01-30 18:11:17.487689"], ["id", 1]]
---
  def update
    @joke = Joke.find(params[:id])

    if @joke.update_attributes(joke_params)