app/views/jokes/show.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
        Author:
      = @joke.user.first_name rescue nil